[
    {
        "_id": "ihifvus74bo98",
        "name": "Bob Marly",
        "details": "I recently used College Booking for organizing a college trip, and it was an exceptional experience! The platform's user-friendly interface made planning and booking seamless. The range of educational tours and activities available was impressive, catering to diverse academic interests. The team's prompt and helpful customer support was invaluable in coordinating all logistics. During the trip, the on-site coordinators were knowledgeable and ensured everything ran smoothly. Overall, College Booking exceeded our expectations, providing a memorable and enriching educational adventure for our college group. I highly recommend it to all colleges seeking a reliable platform for organizing educational trips.",
        "rating": 4.9
      },
      {
        "_id": "s8df7hj4sd8gDSFL",
        "name": "Tom Cruse",
        "details": "Our college group had an amazing experience using College Booking to plan our educational trip. The platform's intuitive design made it easy to explore various destinations and activities. The personalized itinerary allowed us to align the trip with our academic goals. The customer support team was responsive and provided excellent assistance throughout. The trip itself was well-organized, and the educational experiences were both informative and enjoyable. College Booking is a reliable platform, and I highly recommend it for any college looking to create meaningful learning experiences.",
        "rating": 4.7
      },
      {
        "_id": "8sdjfh64sdfSDSFDL",
        "name": "lorem jr",
        "details": "Booking our college excursion through College Booking was a fantastic decision! The platform's wide selection of tours and workshops catered to the diverse interests of our group. The booking process was smooth, and the pricing was transparent. The on-site coordinators were knowledgeable and made our trip engaging and educational. We appreciated the attention to safety and the positive impact on local communities during our journey. College Booking made our trip unforgettable, and we will definitely use their services again for future college adventures!",
        "rating": 4.8
      }
]